append
TYPE_11
METHOD_2
delete
format
java.lang.System.err.println
java.util.Arrays.asList
new
java.util.LinkedList
METHOD_1
VAR_8
0
this
java.util.Properties
TYPE_4
assertThat
"true"
CHAR_6
METHOD_4
|
<
>=
TYPE_2
INT_4
java.lang.NullPointerException
n
STRING_5
finally
writer.write
METHOD_6
operation
[
assertEquals
TYPE_12
CHAR_5
buffer
getContext
java.io.IOException
getValue
FLOAT_6
/=
commit
id
java.util.Map.Entry
error
expr
CHAR_7
java.io.FileReader
intent
str
METHOD_11
function
&=
java.lang.Float
java.util.Collection
put
char
TYPE_3
VAR_4
remove
iterator
y
abstract
java.lang.Double
result
STRING_1
java.lang.Integer.toString
getActivity
0.0
java.net.URL
value
TYPE_1
STRING_7
status
contains
INT_6
diff
words
className
setValue
compareTo
"false"
num
android.content.Intent
getTime
int
view
stringBuilder.append
VAR_7
STRING_2
continue
getText
getId
INT_5
!
break
array
java.util.Vector
java.lang.Thread
if
android.content.Context
TYPE_10
update
TYPE_7
java.util.Calendar.getInstance
buf
java.awt.Font
parameters
static
java.lang.Void
getColor
java.io.FileWriter
errors
STRING_6
build
index
FLOAT_10
TYPE_13
throws
STRING_8
source
isEmpty
+
CHAR_1
getType
toUpperCase
java.lang.System.out.print
METHOD_9
class
getConfig
STRING_13
equals
label
VAR_16
path
min
short
final
java.lang.ClassNotFoundException
message
add
0L
name
byte
line
VAR_11
title
counter
java.lang.Object
startTime
keys
assert
^=
FLOAT_9
-=
k
float
null
number
filePath
1.0
toLowerCase
endTime
CHAR_4
addComponent
,
getSelection
FLOAT_7
response
java.io.File
VAR_5
java.lang.Integer
context
rows
op
||
case
<=
args.length
getBoolean
answer
java.awt.Color
VAR_17
content
state
target
start
STRING_12
file
to
(
date
c
false
tmp
listener
java.util.ArrayList
FLOAT_1
"\n"
assertNotNull
set
temp
1
java.util.Map
NULL
java.lang.Integer.parseInt
VAR_13
split
x
METHOD_10
:
else
==
for
url
*=
"\t"
count
i
--
get
java.util.Random
STRING_9
default
return
]
FLOAT_8
handle
output
getInt
trim
<<=
java.lang.CharSequence
~
attribute
VAR_12
double
public
instanceof
java.io.InputStream
toString
%=
args
STRING_14
VAR_1
event
time
end
params
/
java.util.regex.Matcher
string
java.lang.Exception
private
org.testng.Assert.assertEquals
sum
java.util.Iterator
long
STRING_3
&
VAR_15
?
%
writer
getName
"0"
intValue
FLOAT_4
replace
open
1L
.
synchronized
java.util.List
assertTrue
java.lang.System.exit
>>=
execute
INT_3
var
1.0F
java.lang.String.format
java.lang.Math.abs
substring
METHOD_3
"name"
protected
METHOD_8
node
VAR_6
p
String
boolean
java.io.FileOutputStream
|=
java.lang.Boolean
values
java.lang.StringBuffer
query
FLOAT_3
INT_8
void
src
getString
throw
filename
java.util.logging.Logger.getLogger
java.lang.Math.round
getClass
param
)
java.lang.Throwable
VAR_2
VAR_3
list
TYPE_8
offset
...
TYPE_5
do
*
TYPE_9
INT_1
FLOAT_5
++
INT_2
pattern
!=
extends
size
java.util.HashMap
java.lang.Math.pow
setText
java.util.Scanner
TYPE_14
STRING_4
obj
java.util.Calendar
replaceAll
names
"type"
java.io.BufferedReader
super
getView
data
a
position
fail
key
getIntent
switch
native
;
nodes
catch
out.write
init
j
+=
height
type
0.0F
INT_7
not
STRING_11
VAR_10
java.lang.StringBuilder
VAR_9
FLOAT_2
&&
first
METHOD_5
show
try
msg
element
java.util.Date
java.io.FileInputStream
java.util.HashSet
method
TYPE_6
java.lang.Math.random
field
android.widget.LinearLayout
METHOD_7
java.util.Collections.sort
java.util.Set
fileName
CHAR_2
arg
VAR_14
java.lang.String
fieldName
while
info
true
out
>>>=
{
>
android.widget.Button
token
startsWith
f
java.lang.Long.parseLong
setState
}
java.lang.Long
java.lang.System.out.println
=
t
main
java.lang.Class
text
-
"id"
item
length
android.view.View
b
step
java.io.BufferedWriter
CHAR_3
setEnabled
STRING_10
^
getData
results
select
