type
java.lang.Long.parseLong
text
rows
STRING_12
/=
STRING_14
java.lang.Throwable
getType
STRING_20
filePath
main
||
start
short
instanceof
!=
java.lang.String
c
INT_3
VAR_25
>>>=
first
android.view.View
CHAR_10
String
get
getConfig
listener
METHOD_3
update
toString
FLOAT_6
expr
getTime
STRING_8
+
INT_11
VAR_24
TYPE_2
names
event
VAR_37
x
STRING_24
replaceAll
"type"
tmp
op
STRING_15
STRING_2
1.0
assertTrue
java.lang.NullPointerException
VAR_31
result
STRING_4
INT_1
VAR_12
sum
INT_8
target
class
getBoolean
...
label
open
errors
1L
filename
METHOD_16
item
TYPE_17
<
INT_4
]
line
number
writer
replace
content
METHOD_6
VAR_36
f
METHOD_5
protected
FLOAT_7
FLOAT_5
super
diff
p
>=
java.io.FileReader
STRING_11
assertThat
setValue
FLOAT_2
null
error
VAR_33
METHOD_9
STRING_10
CHAR_7
i
STRING_23
assertNotNull
end
setText
setEnabled
CHAR_4
FLOAT_9
METHOD_18
equals
|=
java.lang.Math.random
TYPE_14
key
b
--
VAR_21
%=
VAR_18
handle
fieldName
VAR_9
assert
init
remove
VAR_23
java.lang.Integer
double
java.util.Arrays.asList
className
FLOAT_1
java.lang.System.exit
temp
to
METHOD_11
byte
operation
native
INT_9
VAR_3
getSelection
TYPE_9
%
VAR_10
java.lang.String.format
VAR_27
(
message
java.lang.Float
java.util.List
TYPE_1
>>=
value
getColor
buffer
info
<=
java.io.FileWriter
METHOD_12
|
values
writer.write
TYPE_6
METHOD_7
for
k
keys
assertEquals
VAR_39
id
select
build
length
*
n
TYPE_13
not
STRING_13
INT_15
java.util.LinkedList
position
source
getValue
java.lang.Boolean
java.util.HashSet
INT_12
"id"
switch
getView
VAR_20
contains
STRING_6
FLOAT_8
FLOAT_4
substring
java.lang.Integer.toString
STRING_18
index
list
;
attribute
java.io.IOException
&=
do
fail
0.0F
msg
"\t"
VAR_8
status
METHOD_2
context
view
1
t
java.lang.Class
METHOD_14
data
results
TYPE_5
format
VAR_35
out
1.0F
stringBuilder.append
step
obj
file
time
CHAR_9
pattern
getContext
"0"
INT_13
boolean
VAR_32
VAR_7
STRING_19
java.util.Scanner
0
output
offset
android.widget.LinearLayout
default
add
VAR_1
while
continue
java.lang.Long
startsWith
VAR_13
TYPE_11
addComponent
response
url
=
METHOD_13
STRING_7
setState
VAR_16
path
array
intent
java.io.FileInputStream
a
public
java.util.HashMap
INT_16
min
java.lang.Math.pow
CHAR_3
toLowerCase
STRING_26
finally
VAR_30
TYPE_10
new
++
CHAR_1
-=
state
toUpperCase
node
VAR_5
TYPE_4
parameters
java.util.Collections.sort
java.util.Vector
startTime
STRING_21
,
<<=
java.lang.StringBuffer
FLOAT_3
VAR_34
count
break
"false"
string
VAR_17
TYPE_3
VAR_29
intValue
show
java.util.Date
TYPE_8
function
java.io.BufferedReader
method
void
CHAR_5
METHOD_1
execute
src
METHOD_4
0L
implements
append
STRING_3
VAR_14
if
throw
args.length
java.io.BufferedWriter
&&
^
STRING_22
CHAR_8
java.util.Properties
out.write
synchronized
{
java.lang.Thread
>
&
split
field.type
java.lang.StringBuilder
catch
STRING_17
java.util.Random
words
java.util.Collection
android.content.Intent
FLOAT_11
static
~
compareTo
!
getInt
STRING_16
?
num
METHOD_15
"name"
[
arg
java.lang.CharSequence
^=
TYPE_16
final
TYPE_7
java.awt.Color
getText
java.util.Calendar.getInstance
java.lang.Void
:
size
STRING_9
INT_7
params
counter
element
VAR_19
TYPE_15
java.util.Map
java.lang.Integer.parseInt
android.content.Context
getClass
VAR_4
name
token
org.testng.Assert.assertEquals
VAR_6
java.lang.Math.abs
METHOD_17
isEmpty
"true"
this
int
TYPE_12
+=
getData
long
VAR_15
java.util.regex.Matcher
set
VAR_11
trim
query
var
TYPE_18
NULL
java.io.FileOutputStream
VAR_28
java.util.Iterator
endTime
VAR_22
commit
java.lang.ClassNotFoundException
return
iterator
java.util.Set
java.awt.Font
INT_2
height
)
field
date
args
INT_6
buf
java.io.File
float
STRING_28
try
METHOD_8
STRING_25
java.lang.Math.round
java.util.logging.Logger.getLogger
java.net.URL
METHOD_10
STRING_5
java.util.Calendar
STRING_27
extends
java.lang.System.err.println
CHAR_6
put
char
VAR_26
INT_5
0.0
"\n"
INT_14
true
java.lang.System.out.println
case
FLOAT_10
getName
android.widget.Button
java.util.ArrayList
nodes
VAR_38
answer
STRING_1
false
java.lang.Object
/
title
}
-
java.lang.Double
INT_10
java.lang.System.out.print
getActivity
private
==
y
*=
.
param
fileName
java.lang.Exception
else
getId
delete
java.util.Map.Entry
getString
java.io.InputStream
CHAR_2
VAR_2
throws
j
getIntent
str
